<template>
  <div class="info" id="info">
    <div class="info-keys">
      <el-tabs type="border-card" @tab-click="tabClick()">
        <el-tab-pane label="0-1岁早教">
          <el-col class="zero-one" v-for="(item, index) in oneList" :key="index">
            <h3>{{ item.info_title }}</h3>
            <p>{{ item.info_desc }}</p>
            <p>{{ item.games }}</p>
            <p>{{ item.games_desc }}</p>
            <p>{{ item.songs }}</p>
            <p>{{ item.songs_desc }}</p>
            <p>{{ item.draw }}</p>
            <p>{{ item.draw_desc }}</p>
          </el-col>
        </el-tab-pane>
        <el-tab-pane label="1-3岁早教">
          <div class="one-three" v-for="(item, index) in twoList" :key="index">
            <h3>{{ item.info_title }}</h3>
            <p>亲子游戏：</p>
            <p>{{ item.games_desc }}</p>
            <p>{{ item.games_descs }}</p>
            <p>儿歌推荐：</p>
            <p>{{ item.songs_desc }}</p>
            <p>绘本推荐：</p>
            <p>{{ item.draws_desc }}</p>
            <p>{{ item.draws_descs }}</p>
          </div>
        </el-tab-pane>
        <el-tab-pane label="3-6岁早教">
          <div class="three-six" v-for="(item, index) in threeList" :key="index">
            <h3>{{ item.info_title }}</h3>
            <p>亲子游戏：</p>
            <p>{{ item.games_desc }}</p>
            <p>{{ item.games_descs }}</p>
            <p>儿歌推荐：</p>
            <p>{{ item.songs_desc }}</p>
            <p>{{ item.songs_desc2 }}</p>
            <p>绘本推荐：</p>
            <p>{{ item.draws_desc }}</p>
            <p>{{ item.draws_desc2 }}</p>
            <p>{{ item.draws_desc3 }}</p>
            <p>{{ item.draws_desc4 }}</p>
          </div>
        </el-tab-pane>
      </el-tabs>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      oneList: [],
      twoList: [
        {
          info_title: '1岁宝宝的教育',
          games_desc: '1、宝宝分辨各种声音：学会听声音、辨别不同的声音和内容，为说话做准备。',
          games_descs: '2、坐轿子',
          songs_desc: '《牵牛花》、《石榴花》、《向日葵》、《月季花》、《黄花开》、《蒲公英》。',
          draws_desc: '1、《小牛的春天》：在《小牛的春天》中，他运用文字和图画的双重叙事功能，巧妙地设计出了两条故事线索。一条是关于春夏秋冬，四季的交替;一条是关于小牛的成长。巧妙新颖的构思，妙趣横生的想象，让每个人都体味到生命带给我们的感动。',
          draws_descs: '2、《我爸爸》：讲述父子亲情的书籍多如牛毛，但是很少有像《我爸爸》这样的角度和方式， 真正撼动心灵地描绘了孩子对于父亲的热爱和崇拜。通过简单朴实的语言，和精心设计的排比句式，用孩子的口吻和眼光来描绘一位既强壮又温柔的爸爸，不仅样样事情都在行、给孩子十足的安全感，还温暖得像太阳一样。'
        },
        {
          info_title: '1岁半宝宝的教育',
          games_desc: '1、洗澡真有趣：宝宝在洗澡时很高兴，大人可以利用这个时间来教宝宝说话，宝宝可以根据实物来激烈，这对宝宝的语言发展有好处。',
          games_descs: '2、记住朋友的名字：这个游戏让宝宝记住同伴的名字，锻炼宝宝的语言能力。',
          songs_desc: '花朵系列：《牵牛花》、《石榴花》、《向日葵》、《月季花》、《黄花开》、《蒲公英》;想象力系列：《好哇好》、《老和尚背着鼓来了》、《我们想》、《哈哈镜》、《星星宝宝要睡觉》、《笨孩子》',
          draws_desc: '1、《小酷和小玛的认知绘本》',
          draws_descs: '2、《世界儿童珍爱的100个经典童话》'
        },
        {
          info_title: '2岁宝宝的教育',
          games_desc: '1、宝宝知道怎么办：这个游戏让宝宝学习解决问题，并且有利于他增加词汇量，有利于他语言能力的发展。',
          games_descs: '2、高高矮矮真有趣：这个游戏能让宝宝的身体得到很好的伸屈。',
          songs_desc: '日常生活系列：《指甲刀》、《小小象》、《小弟弟》、《花手绢》、《红苹果》、《刷牙》、《蚯蚓》、《两只小胖手》;想象力系列：《我请星星来洗脸》、《水里的娃娃》、《新房子》、《外语角》、《蚂蚁搬豆》、《蜗牛看花》',
          draws_desc: '1、《古利和古拉》：充满了孩童的真趣，简单的快乐中蕴涵着对生活的热爱，是一代代读者心中永恒的记忆与感动。',
          draws_descs: '2、《你睡不着吗》：一本非常经典的睡前故事读本，简简单单的生活片段中酝酿的是亲子间的亲密和关怀，非常适合帮助孩子建立安全感。'
        }
      ],
      threeList: [
        {
          info_title: '3岁孩子的教育',
          games_desc: '1、广播电台：这个游戏着重培养孩子口齿清楚、态度大方，有表情说故事和念诗歌。',
          games_descs: '2、传电报：这个游戏着重培养孩子的记忆力和语言表达能力。',
          songs_desc: '1、节约用水系列：《节约用水儿歌》、《请君节约用水》、《节约每滴水》、《节约用水》',
          songs_desc2: '2、形象力系列：《好哇好》、《老和尚背着鼓来了》、《我们想》、《哈哈镜》、《星星宝宝要睡觉》、《笨孩子》',
          draws_desc: '1、《巴巴爸爸》：只有想不到，没有做不到——在巴巴爸爸家里可以做一切疯狂的事。',
          draws_desc2: '2、《不一样的卡梅拉》：因其丰富生动、幽默诙谐的故事情节和活泼可爱、机智勇敢的小鸡形象而深受广大小读者喜爱和众多家长的肯定。',
          draws_desc3: '3、《好友记》：以一只小鸭和小鹅的友情，为孩子们讲述了友情的可贵，让我们一起好好感受吧!',
          draws_desc4: '4、《卡米的故事》：只是一些生活中的成长故事，无非就是不喜欢洗澡，害怕打针，也不想睡觉，还尿尿在裤子上了……而这些小故事，就是孩子的成长生活。'
        },
        {
          info_title: '4岁孩子的教育',
          games_desc: '1、悄悄话：这个游戏锻炼宝宝的听力，让孩子养成专心聆听别人说话的习惯，并可锻炼宝宝准确发音。',
          games_descs: '2、我是老板：此游戏主要是培养宝宝模仿大人说的话或是做的事。',
          songs_desc: '1.好习惯系列：《吃饭》、《睡觉》、《走路》、《太阳公公起得早》、《大人做事不打扰》、《不再麻烦好妈妈》',
          songs_desc2: '2、动物系列：《老虎》、《熊猫》、《孔雀》、《穿山甲》',
          draws_desc: '1、《蒲公英系列》：为孩子们呈现了一幕幕关于“爱”的温馨画面，让孩子们深深地感受到爱的无处不在，学会接受爱，学会爱别人。',
          draws_desc2: '2、《当我长大时》：是一套讲出孩子心声，引起孩子共鸣并不断偷偷发笑的书;是一套让家长回味童年，勾起无数温暖回忆的书。',
          draws_desc3: '3、《我的爸爸叫焦尼》：一对父子手牵着手，一个抬头，一个低头，四目相对，相似的模样，微笑也一样，这样温馨的场面不用多，只是一眼，就会深深地打动你。!',
          draws_desc4: '4、《三只小猪的真实故事》：绘本《三只小猪的真实故事》中，那只可恶的大灰狼却向我们控诉“三只小猪”的“真实”情况!这，究竟发生什么事情了呢?'
        },
        {
          info_title: '5岁孩子的教育',
          games_desc: '1、客厅和厨房：用游戏培养孩子的语言表达能力，要让游戏的内容与他们的日常生活有机地结合起来，孩子们就会感兴趣，就会积极主动地参加到游戏中来。',
          games_descs: '2、改编故事，增多角色：通过变化角色给幼儿带来新鲜感和不同程度的难度，激发幼儿的表演欲望和提高幼儿自身的语言表达能力。',
          songs_desc: '1、英语单词系列：《动物名词歌》、《颜色歌》、《水果歌》、《我的一天》《文具用品类》、《说儿歌，记快餐》',
          songs_desc2: '2、经典儿歌系列：《数鸭子》、《小兔子乖乖》、《丢手绢》、《找朋友》《蜗牛与黄鹂鸟》、《荡秋千》',
          draws_desc: '1、《大脚丫跳芭蕾》：爱跳舞的贝琳达有一双大脚，谁会想到她能跳舞，而且跳得那么好呢?在权威的话语下，她开始怀疑自己，失去了自信。幸好，她虽然难过，但她从来没有放弃舞蹈。',
          draws_desc2: '2、《妈妈的红沙发》：主角是一个小女孩，通过她第一人称的自述，娓娓诉说一个单亲落魄家庭为梦想而努力奋斗的故事。',
          draws_desc3: '3、《莉莉的紫色小皮包》：小小的绘本为孩子们讲述了一个大大的道理，讲到了将伴随人终生的一种基本的、积极的人格因素，也是儿童由幼稚走向成熟、由依赖走向独立的重要标志。',
          draws_desc4: '4、“我真棒”系列：本书在这套故事绘本中，我们能够看到很多不同的情感，或正面，或反面。作为妈妈，我多么希望孩子幼小的心灵里，不要被这些负面的词汇所污染啊。'
        },
        {
          info_title: '6岁孩子的教育',
          games_desc: '1、模拟小课堂：让幼儿感受小学生上课和幼儿园活动的不同。',
          games_descs: '2、故事《重要电话》：让幼儿理解故事内容，能依据情节图与同伴协商、分工合作进行表演，表达对故事的理解。',
          songs_desc: '1、数理系列：《运算顺序歌诀》、《多位数读法歌》、《凑十法儿歌》、《四则混合运算的运算顺序》、《除的意义》',
          songs_desc2: '2、日常文具系列：《小书包》、《笔的歌》、《小尺子》、《橡皮擦》、《小铅笔》、《铅笔盒》',
          draws_desc: '1、《生命的故事》：是一套适合3～6岁孩子阅读的性教育图书，它以生动的图画和文字，解答了孩子最为关心的生命的来源问题;解答了孩子对自己性别的疑惑。?在权威的话语下，她开始怀疑自己，失去了自信。幸好，她虽然难过，但她从来没有放弃舞蹈。',
          draws_desc2: '2、《学会爱自己》系列：是一套主题特别的图画书，对那些即将离开父母的视线、进入校园学习的孩子们来说，这是一套非常有帮助的教科书。',
          draws_desc3: '3、《儿童好奇心大百科》：该书分四个部分，涵盖了动物、人体、自然、生活等多方面的科普知识，这些恰恰是少儿在日常生活中被问及频率最高的。',
          draws_desc4: '4、《再见,小兔子》：本书借用一个隐喻的形式，引导人们去思考生活的惯性与出发的梦想!'
        }
      ]
    }
  },
  created() {
    this.tabClick()
  },
  methods: {
    tabClick() {
      this.$axios.post('api/user/getinfoOne').then( res => {
        res = res.data
        this.oneList = res
      })
    }
  },
}
</script>

<style>
#info{
  text-align: left;
}
  .info {
    width: 80%;
    padding: 20px 10%;
  }
  .info-keys {
    width: 100%;
  }
  .zero-one,
  .one-three,
  .three-six {
    width: 100%;
    display: flex;
    flex-wrap: wrap;
  }
  .info-keys p {
    display: flex;
    width: 100%;
    align-self: flex-start;
    text-indent: 2em;
  }
</style>
