<template>
  <div class="info">
    <div class="info-keys">
      <el-tabs type="border-card">
        <el-tab-pane label="0-1岁早教">
          <el-col class="zero-one">
            <h3>1个月宝宝早教</h3>
            <p>从本月开始，是你和宝宝度过的所有的美好游戏时间的开始。对宝宝来说，游戏是生活的重心，特别是婴儿期间的游戏，与身心发育有着密切的关联。和婴儿互动时要密切留意他/她。当宝宝的眼光转开、扭动身体、变得焦躁、踢腿、打哈欠或似乎不高兴时，你就能够判断地出来他已经玩够了。</p>
            <p>亲子游戏:</p>
            <p>1、妈妈教给小宝宝：这个游戏引导宝宝模仿发出1-2个元音，如a、o等。</p>
            <p>2、翻跟头</p>
            <p>儿歌推荐:</p>
            <p>《小娃娃》、《小宝宝》、《点点窝窝》、《洗澡》、《喝牛奶》、《吃豆豆》、《外婆桥》、《我是好宝宝》、《学走路》。</p>
            <p>绘本推荐：</p>
            <p>1、《动物园》：朝上翻，碗变熊猫藏里边；往下翻，风筝变鹰笼中关；小朋友，打开书本翻一翻，动物园里喜连连！</p>
            <p>2、《农场》：绚烂的色彩，美妙的画面，独特的折页上翻下翻的有趣形式，让孩子在乐趣中逐渐懂得农场的常识。看似简单的形式蕴含了作者独特的创意，苹果一翻变成了天使，座椅一翻变成了狮子，吸引孩子主动去翻阅，在连连的翻阅中获得重重的惊喜，也打下了认知的基础，有助于开发孩子天才的大脑和创意。</p>
          </el-col>
        </el-tab-pane>
        <el-tab-pane label="1-3岁早教">
          <div class="one-three">
            <h3>1岁宝宝的教育</h3>
            <p>亲子游戏：</p>
            <p>1、宝宝分辨各种声音：学会听声音、辨别不同的声音和内容，为说话做准备。</p>
            <p>游戏步骤：你要先把宝宝熟悉的人或物的声音一一录下来，如爸爸、妈妈或其他亲人的讲话声，汽车的喇叭声，狗的叫声等。游戏开始时，按动录音机，逐一播放给宝宝听。然后让宝宝说出听到的是什么声音。不要选择太相像的两种声音，以免宝宝答错后有挫败感。如果宝宝答对了，记得要称赞宝宝。</p>
            <p>2、坐轿子</p>
            <p>儿歌推荐：</p>
            <p>《牵牛花》、《石榴花》、《向日葵》、《月季花》、《黄花开》、《蒲公英》。</p>
            <p>绘本推荐：</p>
            <p>1、《小牛的春天》：在《小牛的春天》中，他运用文字和图画的双重叙事功能，巧妙地设计出了两条故事线索。一条是关于春夏秋冬，四季的交替;一条是关于小牛的成长。巧妙新颖的构思，妙趣横生的想象，让每个人都体味到生命带给我们的感动。</p>
            <p>2、《我爸爸》：讲述父子亲情的书籍多如牛毛，但是很少有像《我爸爸》这样的角度和方式， 真正撼动心灵地描绘了孩子对于父亲的热爱和崇拜。通过简单朴实的语言，和精心设计的排比句式，用孩子的口吻和眼光来描绘一位既强壮又温柔的爸爸，不仅样样事情都在行、给孩子十足的安全感，还温暖得像太阳一样。</p>
          </div>
        </el-tab-pane>
        <el-tab-pane label="3-6岁早教">
          <div class="three-six">
            <h3>3岁宝宝的教育</h3>
            <p>亲子游戏：</p>
            <p>1、广播电台：这个游戏着重培养孩子口齿清楚、态度大方，有表情说故事和念诗歌。</p>
            <p>2、传电报：这个游戏着重培养孩子的记忆力和语言表达能力。</p>
            <p>儿歌推荐：</p>
            <p>1、节约用水系列：《节约用水儿歌》、《请君节约用水》、《节约每滴水》、《节约用水》</p>
            <p>2、形象力系列：《好哇好》、《老和尚背着鼓来了》、《我们想》、《哈哈镜》、《星星宝宝要睡觉》、《笨孩子》</p>
            <p>绘本推荐：</p>
            <p>1、《巴巴爸爸》：只有想不到，没有做不到——在巴巴爸爸家里可以做一切疯狂的事。</p>
            <p>2、《不一样的卡梅拉》：因其丰富生动、幽默诙谐的故事情节和活泼可爱、机智勇敢的小鸡形象而深受广大小读者喜爱和众多家长的肯定。</p>
            <p>3、《好友记》：以一只小鸭和小鹅的友情，为孩子们讲述了友情的可贵，让我们一起好好感受吧!</p>
            <p>4、《卡米的故事》：只是一些生活中的成长故事，无非就是不喜欢洗澡，害怕打针，也不想睡觉，还尿尿在裤子上了……而这些小故事，就是孩子的成长生活。</p>
          </div>
        </el-tab-pane>
      </el-tabs>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      input3: '',
      input4: '',
      input5: '',
      select: ''
    }
  }
}
</script>

<style lang="scss">
  .info {
    width: 80%;
    // background-color:pink;
    padding: 20px 10%;
  }
  .info-keys {
    width: 100%;
  }
  .zero-one,
  .one-three,
  .three-six {
    width: 100%;
    display: flex;
    flex-wrap: wrap;
  }
  .info-keys p {
    display: flex;
    width: 100%;
    align-self: flex-start;
    text-indent: 2em;
  }
</style>
